Revit 2026 API

# NumberingSchemaTypesStructuralNumberingSchemas Class

---

A collection of types of built-in Numbering Schemas that are used for numbering structure elements.

SystemObject Autodesk.Revit.DBNumberingSchemaTypesStructuralNumberingSchemas

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class StructuralNumberingSchemas
```
```vb
Public NotInheritable Class StructuralNumberingSchemas
```
```cpp
public ref class StructuralNumberingSchemas abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type StructuralNumberingSchemas = class end
```

The NumberingSchemaTypesStructuralNumberingSchemas type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Rebar | Built-in schema used for numbering rebar elements |
|  | RebarCoupler | Built-in schema used for numbering rebar coupler elements |
|  | ReinforcementFabric | Built-in schema used for numbering fabric reinforcement elements |

#### Reference

Autodesk.Revit.DB Namespace